DataProcessors/Использование_RegExp.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>Использование_RegExp</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсходнаяСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегулярноеВыражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/Использование_RegExp/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ExecuteНаСервере()
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.Pattern = Объект.РегулярноеВыражение;
	RegExp.Global = Истина;
	RegExp.MultiLine = Истина;
	Matches = RegExp.Execute(Объект.ИсходнаяСтрока);
	
	Результат = "";
	Для Счетчик = 0 По Matches.Count - 1 Цикл 
    	Результат = Результат + Matches.Item(Счетчик).Value + Символы.ПС;
	КонецЦикла;
	Объект.Результат = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаExecute(Команда)
	ExecuteНаСервере();
КонецПроцедуры
